#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.KEYCLOAK_DEV.module.moh_citizen.module.EMACCS.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "EMACCS"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Emergency Medical Assistant Continuing Competency System"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "EMACCS"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_citizen"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:8080/*",
          + "https://emaccsd.hlth.gov.bc.ca/*",
          + "https://logontest7.gov.bc.ca/clp-cgi/logoff.cgi*",
        ]
    }

  # module.KEYCLOAK_DEV.module.moh_citizen.module.EMACCS.module.payara-client.keycloak_openid_client.CLIENT will be destroyed
  # (because keycloak_openid_client.CLIENT is not in configuration)
  - resource "keycloak_openid_client" "CLIENT" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = false -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "EMACCS" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - description                                = "Emergency Medical Assistant Continuing Competency System" -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = false -> null
      - id                                         = "385d2ef8-7143-46ef-99b6-f6fd9eae82e6" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "EMACCS" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "moh_applications" -> null
      - service_account_user_id                    = "4a5925a0-b0f0-453e-83e8-c62e63c2111b" -> null
      - service_accounts_enabled                   = true -> null
      - standard_flow_enabled                      = true -> null
      - use_refresh_tokens                         = false -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [
          - "http://localhost:8080/*",
          - "https://emaccsd.hlth.gov.bc.ca/*",
          - "https://logontest7.gov.bc.ca/clp-cgi/logoff.cgi*",
        ] -> null
      - web_origins                                = [] -> null
    }

  # module.KEYCLOAK_DEV.module.moh_citizen.module.EMACCS.module.payara-client.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper will be destroyed
  # (because keycloak_openid_user_client_role_protocol_mapper.client_role_mapper is not in configuration)
  - resource "keycloak_openid_user_client_role_protocol_mapper" "client_role_mapper" {
      - add_to_access_token         = true -> null
      - add_to_id_token             = false -> null
      - add_to_userinfo             = false -> null
      - claim_name                  = "EMACCS_role_not_used" -> null
      - claim_value_type            = "String" -> null
      - client_id                   = "385d2ef8-7143-46ef-99b6-f6fd9eae82e6" -> null
      - client_id_for_role_mappings = "EMACCS" -> null
      - id                          = "d7ed0850-2346-4da2-b2cd-dd4d32477fd7" -> null
      - multivalued                 = true -> null
      - name                        = "EMACCS Role - Not Used" -> null
      - realm_id                    = "moh_applications" -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*